---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ClineSubcategory
source: html/68b8e0f2-b5cd-8deb-44b4-f90d79e866a7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ClineSubcategory Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId ClineSubcategory { get; }
```